## Production: alarms 🚨
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                       NAME                                        |
|--------|-----------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.platform_gc_forms_etl_user_processed_record_anomaly` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.platform_gc_forms_etl_user_processed_record_anomaly will be created
  + resource "aws_cloudwatch_metric_alarm" "platform_gc_forms_etl_user_processed_record_anomaly" {
      + actions_enabled                       = true
      + alarm_description                     = "'Platform / GC Forms' ETL job anomaly detection for the 'user' dataset."
      + alarm_name                            = "platform-gc-forms-etl-user-processed-record-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanLowerOrGreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold_metric_id                   = "processed_records_expected"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "processed_records"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "Dataset" = "processed-data/user"
                }
              + metric_name = "ProcessedRecordCount"
              + namespace   = "data-lake/etl/gc-forms"
              + period      = 86400
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(processed_records)"
          + id          = "processed_records_expected"
          + label       = "Processed Records (Expected)"
          + return_data = false
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.glue_job_failure"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_crawler_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_etl_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_job_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.platform_gc_forms_etl_user_processed_record_anomaly"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_alarm_action"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_ok_action"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
